app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `id` = '12'
 LIMIT 1
---
    public function profilAdmin()
    {
        $session = session();

        $model = new UserModel();

        $foto = $model->where('id', $session->get('id'))->first();

SELECT *
FROM `users`
WHERE `id` = '14'
 LIMIT 1
---
    public function profilUser()
    {
        $session = session();

        $model = new UserModel();

        $foto = $model->where('id', $session->get('id'))->first();

SELECT *
FROM `users`
WHERE `username` = 'nanda'
 LIMIT 1
INSERT INTO `users` (`username`, `password`, `status`, `foto`, `ttl`) VALUES ('nanda', '$2y$10$gY5dSsa3mm0Jtlb5C8n1B.bGtGOh7BIgXIqzFFO9yRuqL4O5GAnRG', 'user', '1777476826_7e5749ce3bc07c97eab8.png', '2026-04-16')
---
    public function createAccount()
    {
        $model = new UserModel();

        // 1. Ambil input dari form
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $ttl = $this->request->getVar('ttl');

        $fileCover = $this->request->getFile('cover');

        // 2. Cek apakah ada file yang diunggah
        if ($fileCover && $fileCover->isValid() && !$fileCover->hasMoved()) {
            // Berikan nama random agar tidak ada file dengan nama yang sama
            $namaCover = $fileCover->getRandomName();

            // Pindahkan file ke folder public/foto
            $fileCover->move('foto/user', $namaCover);
        } else {
            // Jika tidak ada file, set nama default
            $namaCover = 'default.jpg';
        }

        // 2. Cek apakah username sudah ada di database
        $userExist = $model->where('username', $username)->first();
        if ($userExist) {
            return redirect()->back()->withInput()->with('error', 'Username sudah terdaftar, silakan gunakan yang lain.');
        }

        // 3. Simpan data dengan password yang sudah di-hash (disamarkan)
        $model->save([
            'username' => $username,
            'password' => password_hash($password, PASSWORD_DEFAULT), // Membuat password tidak kelihatan di DB
            'status'   => 'user', // Default status untuk akun baru
            'foto'  => $namaCover,
            'ttl' => $ttl
        ]);

SELECT *
FROM `users`
WHERE `username` = 'opang'
 LIMIT 1
---
    public function createAccountAdmin()
    {
        $model = new UserModel();

        // 1. Ambil input dari form
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $ttl = $this->request->getVar('ttl');

        $fileCover = $this->request->getFile('cover');

        // 2. Cek apakah ada file yang diunggah
        if ($fileCover && $fileCover->isValid() && !$fileCover->hasMoved()) {
            // Berikan nama random agar tidak ada file dengan nama yang sama
            $namaCover = $fileCover->getRandomName();

            // Pindahkan file ke folder public/foto
            $fileCover->move('foto', $namaCover);
        } else {
            // Jika tidak ada file, set nama default
            $namaCover = 'default.jpg';
        }

        // 2. Cek apakah username sudah ada di database
        $userExist = $model->where('username', $username)->first();