app/Controllers/Keranjang.php

SELECT `cart`.`id` as `cart_id`, `cart`.`jumlah`, `books`.*
FROM `cart`
JOIN `books` ON `books`.`id` = `cart`.`book_id`
WHERE `cart`.`user_id` = '2'
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/auth');
        }

        $cartModel = new \App\Models\Keranjang();
        $userId = session()->get('id');

        $items = $cartModel->select('cart.id as cart_id, cart.jumlah, books.*')
            ->join('books', 'books.id = cart.book_id')
            ->where('cart.user_id', $userId)
            ->findAll();