app/Controllers/Library.php

SELECT *
FROM `books`
---
    public function user()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/auth');
        }

        $model = new BukuModel();
        $data = [
            'title' => 'Koleksi Buku',
            'username' => session()->get('username'),
            'books' => $model->findAll()