app/Controllers/Transaksi.php

SELECT *
FROM `users`
WHERE `status` = 'user'
---
    public function index()
    {
        $transaksiModel = new \App\Models\TransaksiModel();
        $bukuModel      = new \App\Models\BukuModel();
        $userModel      = new \App\Models\UserModel();

        $data = [
            'title'      => 'Data Peminjaman',
            'transaksi'  => $transaksiModel->getTransaksiLengkap(), // Fungsi join yang kita buat sebelumnya
            'buku'       => $bukuModel->findAll(),
            'users'      => $userModel->where('status', 'user')->findAll()