app/Models/TransaksiModel.php

    public function getTransaksiLengkap()
    {
       return $this->select('transaksi.*, users.username, books.title')
            ->join('users', 'users.id = transaksi.user_id')
            ->join('books', 'books.id = transaksi.book_id')
            // Logika: Jika status 'Dipinjam' beri nilai 1, selain itu 2. Lalu urutkan dari terkecil.
            ->orderBy("CASE
                WHEN transaksi.status = 'Dipinjam' THEN 1
                WHEN transaksi.status = 'Kembali' THEN 2
                ELSE 3 END", 'ASC')
            ->orderBy('transaksi.created_at', 'DESC') // Urutan kedua: yang terbaru
            ->findAll();
---
SELECT `transaksi`.*, `users`.`username`, `books`.`title`
FROM `transaksi`
JOIN `users` ON `users`.`id` = `transaksi`.`user_id`
JOIN `books` ON `books`.`id` = `transaksi`.`book_id`
ORDER BY CASE 
                WHEN transaksi.status = 'Dipinjam' THEN 1 
                WHEN transaksi.status = 'Kembali' THEN 2
                ELSE 3 END ASC, `transaksi`.`created_at` DESC